Revit 2024 API
BuildingEnvelopeAnalyzer Properties
The BuildingEnvelopeAnalyzer type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
BuildingEnvelopeAnalyzer Class
Autodesk.Revit.DB.Analysis Namespace